# CLI Tools
brew "neovim"
brew "fzf"
brew "mise"
brew "starship"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "lazygit"

# Shell plugins
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Database
brew "postgresql@16"
brew "libpq"

# Applications
cask "ghostty"
cask "aerospace"
cask "font-jetbrains-mono-nerd-font"
